cat-tinder-backend/app/controllers/cats_controller.rb

    def create
        @cat = Cat.create(cat_params)
---
INSERT INTO "cats" ("name", "age", "enjoys", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Kevin"], ["age", 1], ["enjoys", "Playing with yarn."], ["created_at", "2019-07-25 19:00:52.809720"], ["updated_at", "2019-07-25 19:00:52.809720"]]

    def update
        @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]

    def destroy
        @cats = Cat.all
        @cat = Cat.find(params[:id])
        @cat.destroy
---
SELECT "cats".* FROM "cats"
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 18]]